//Copyright (c) 2022 user1687569
#include <stdio.h>

int main()
{
    printf("%6d, %4d\n", 86, 1040);
    printf("%12.5e\n", 30.253);
    printf("%.4f\n", 83.162);
    printf("%-6.2g\n", .0000009979);

    return 0;
}


//     86, 1040
// 3.02530e+001
// 83.1620
// 1e-006


// (a) 指数表示形式, 字段宽度8, 左对齐, 小数点后保留1位数字
// printf("%-8.1e", number);
// (b) 指数表示形式, 字段宽度10, 右对齐, 小数点后保留6位数字
// printf("%10.6e", number);
// (c) 定点十进制表示形式, 字段宽度8, 左对齐, 小数点后保留3位数字
// printf("%-8.3f", number);
// (d) 定点十进制表示形式, 字段宽度6, 右对齐, 小数点后无数字
// printf("%6f", number);
